Ran Plan for 6 projects:

1. project: `applications-network-helia` dir: `applications/network/env/helia` workspace: `default`
1. project: `applications-network-production` dir: `applications/network/env/production` workspace: `default`
1. project: `applications-network-staging` dir: `applications/network/env/staging` workspace: `default`
1. project: `rdot-helia` dir: `rdot/env/helia` workspace: `default`
1. project: `rdot-production` dir: `rdot/env/production` workspace: `default`
1. project: `rdot-staging` dir: `rdot/env/staging` workspace: `default`
---

### 1. project: `applications-network-helia` dir: `applications/network/env/helia` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.27.0...
- Installed hashicorp/aws v6.27.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.my_bucket.aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "network-helia-bucket15256"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "us-east-1"
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "helia"
        }
+       tags_all                    = {
+           "Environment" = "helia"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[0] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "helia"
+           "Name"        = "helia-atlantis-private-1"
        }
+       tags_all                                       = {
+           "Environment" = "helia"
+           "Name"        = "helia-atlantis-private-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[1] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "helia"
+           "Name"        = "helia-atlantis-private-2"
        }
+       tags_all                                       = {
+           "Environment" = "helia"
+           "Name"        = "helia-atlantis-private-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "us-east-1"
+       tags                                 = {
+           "Environment" = "helia"
+           "Name"        = "helia-atlantis-vpc"
        }
+       tags_all                             = {
+           "Environment" = "helia"
+           "Name"        = "helia-atlantis-vpc"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/32/default/applications/network/env/helia/applications-network-helia-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/32/default/applications/network/env/helia/applications-network-helia-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p applications-network-helia
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://rpg4xf7iyi.execute-api.us-east-1.amazonaws.com/atlantis/lock?id=RameezAhmedZaka%252FECS-Atlantis%252Fapplications%252Fnetwork%252Fenv%252Fhelia%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p applications-network-helia
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 2. project: `applications-network-production` dir: `applications/network/env/production` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.27.0...
- Installed hashicorp/aws v6.27.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.my_bucket.aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "network-prod-bucket42711543"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "us-east-1"
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "production"
        }
+       tags_all                    = {
+           "Environment" = "production"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[0] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-1"
        }
+       tags_all                                       = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[1] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-2"
        }
+       tags_all                                       = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "us-east-1"
+       tags                                 = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-vpc"
        }
+       tags_all                             = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-vpc"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/32/default/applications/network/env/production/applications-network-production-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/32/default/applications/network/env/production/applications-network-production-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p applications-network-production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://rpg4xf7iyi.execute-api.us-east-1.amazonaws.com/atlantis/lock?id=RameezAhmedZaka%252FECS-Atlantis%252Fapplications%252Fnetwork%252Fenv%252Fproduction%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p applications-network-production
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 3. project: `applications-network-staging` dir: `applications/network/env/staging` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.27.0...
- Installed hashicorp/aws v6.27.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.my_bucket.aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "network-stage-bucet3745"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "us-east-1"
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "staging"
        }
+       tags_all                    = {
+           "Environment" = "staging"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[0] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-private-1"
        }
+       tags_all                                       = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-private-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[1] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-private-2"
        }
+       tags_all                                       = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-private-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "us-east-1"
+       tags                                 = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-vpc"
        }
+       tags_all                             = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-vpc"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/32/default/applications/network/env/staging/applications-network-staging-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/32/default/applications/network/env/staging/applications-network-staging-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p applications-network-staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://rpg4xf7iyi.execute-api.us-east-1.amazonaws.com/atlantis/lock?id=RameezAhmedZaka%252FECS-Atlantis%252Fapplications%252Fnetwork%252Fenv%252Fstaging%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p applications-network-staging
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 4. project: `rdot-helia` dir: `rdot/env/helia` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.27.0...
- Installed hashicorp/aws v6.27.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.my_bucket.aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "network-helia-bucket11756"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "us-east-1"
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "helia"
        }
+       tags_all                    = {
+           "Environment" = "helia"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[0] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "helia"
+           "Name"        = "helia-atlantis-private-1"
        }
+       tags_all                                       = {
+           "Environment" = "helia"
+           "Name"        = "helia-atlantis-private-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[1] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "helia"
+           "Name"        = "helia-atlantis-private-2"
        }
+       tags_all                                       = {
+           "Environment" = "helia"
+           "Name"        = "helia-atlantis-private-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "us-east-1"
+       tags                                 = {
+           "Environment" = "helia"
+           "Name"        = "helia-atlantis-vpc"
        }
+       tags_all                             = {
+           "Environment" = "helia"
+           "Name"        = "helia-atlantis-vpc"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/32/default/rdot/env/helia/rdot-helia-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/32/default/rdot/env/helia/rdot-helia-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p rdot-helia
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://rpg4xf7iyi.execute-api.us-east-1.amazonaws.com/atlantis/lock?id=RameezAhmedZaka%252FECS-Atlantis%252Frdot%252Fenv%252Fhelia%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p rdot-helia
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 5. project: `rdot-production` dir: `rdot/env/production` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.27.0...
- Installed hashicorp/aws v6.27.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.my_bucket.aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "network-prod-bucket71113"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "us-east-1"
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "production"
        }
+       tags_all                    = {
+           "Environment" = "production"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[0] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-1"
        }
+       tags_all                                       = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[1] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-2"
        }
+       tags_all                                       = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "us-east-1"
+       tags                                 = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-vpc"
        }
+       tags_all                             = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-vpc"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/32/default/rdot/env/production/rdot-production-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/32/default/rdot/env/production/rdot-production-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p rdot-production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://rpg4xf7iyi.execute-api.us-east-1.amazonaws.com/atlantis/lock?id=RameezAhmedZaka%252FECS-Atlantis%252Frdot%252Fenv%252Fproduction%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p rdot-production
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 6. project: `rdot-staging` dir: `rdot/env/staging` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.27.0...
- Installed hashicorp/aws v6.27.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.my_bucket.aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "network-stage-bucket3345"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "us-east-1"
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "staging"
        }
+       tags_all                    = {
+           "Environment" = "staging"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[0] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-private-1"
        }
+       tags_all                                       = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-private-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[1] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-private-2"
        }
+       tags_all                                       = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-private-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "us-east-1"
+       tags                                 = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-vpc"
        }
+       tags_all                             = {
+           "Environment" = "staging"
+           "Name"        = "stage-atlantis-vpc"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/32/default/rdot/env/staging/rdot-staging-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/32/default/rdot/env/staging/rdot-staging-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p rdot-staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://rpg4xf7iyi.execute-api.us-east-1.amazonaws.com/atlantis/lock?id=RameezAhmedZaka%252FECS-Atlantis%252Frdot%252Fenv%252Fstaging%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p rdot-staging
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### Plan Summary

6 projects, 6 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```